import { useRef, useContext } from 'react';
import Sliders from "../../sliders/Sliders";
import Title from "../../title/Title";
import Text from "../../text/Text";
import BorderLine from "../../borderLine/BorderLine";
import Main from "../../main/Main";
import hadassaPic from "../../../shared/assets/images/hani.jpg";
import mayaPic from "../../../shared/assets/images/hofit.jpg";
import { Card } from "@mui/material";
import Question from "../../question/Question";
import Gallery from "../../gallery/Gallery";
import Contact from "../../contact/Contact";
import style from './Home.module.css';
import Header from '../../header/Header';
import Footer from '../../footer/Footer';
import CustomButton from '../../customButton/CustomButton';
import AdminContext from '../../../shared/contexts/AdminContext';

const questions = [
    {
        question: "למה קבוצת בנות?",
        answer: "ישנן נערות שטיפול פרטני עלול להחוות על ידן כמאיים או כלא מדוייק לצרכיהן, במרחב נשי ואינטימי יש מקום לכל נערה להתבטא בקצב שלה ובמינונים הנכונים לה, תוך כדי חשיפה ולמידה מחוויות של נערות אחרות בנות גילה. חשיפה זו מעודדת להיפתח ולמצוא תכנים משותפים העשויים ליצור תחושת שייכות ונראות. קבוצה עשויה לתרום גם לנערות עם קשיים חברתיים באמצעות התנסויות ורכישת מיומנויות וכישורים חברתיים. כמו כן, מחקרים מראים כי המרחב הנשי מאפשר פרידה זמנית מהמציאות היומיומית והחברתית, כמו גם שיח על נושאים שיש קושי לדבר עליהם בקבוצה מעורבת, אלו מעודדים את הנערות לאינטגרציה והעצמה אישית. קשרים חברתיים בחייהן של נשים הינם גורם הכרחי להמשך צמיחתן הפסיכולוגית ולהתפתחותן התקינה."
    },
    {
        question: "למה דווקא אנחנו?",
        answer: "אנו נשות מקצוע בעולם הטיפול בעלות ניסיון רב בעבודה עם בני נוער ונערות בפרט, רכשנו כלים לאורך השנים לשיח מקדם עם נערות על נושאים המעסיקים אותן. בנוסף, אנו עובדות כמטפלות פרטניות וקבוצתיות ומנוסות בשיח רגשי ובעבודה המותאמת באופן פרטני לכל נערה. אנו מציעות סדנה המספקת כלים וידע המשמעותיים בתקופת גיל ההתבגרות שכן זוהי תקופת של התגבשות הזהות. הסדנה פונה לרובד הרגשי של הנערה ובודקת כיצד מצבה הרגשי משפיע על התנהגותה ובחירותיה."
    },
    {
        question: "לאיזה קבוצות הסדנה מתאימה?",
        answer: "* לקבוצת חברות המעוניינת בחוויה מעשירה ואינטימית. * לליווי קבוצת בנות מצווה.* לקבוצת נערות הנמצאות בעיצומו של תהליך ההתבגרות. לקבוצת נערות תיכון כהכנה לחיים הבוגרים."
    },
    {
        question: "מה אורכו של מפגש?",
        answer: "אורכו של מפגש כשעתיים."
    },
    {
        question: "היכן מתקיימים המפגשים?",
        answer: "אנו זקוקות למרחב בו נוכל לשבת במעגל, על כיסאות או על כריות. המפגשים יכולים להתקיים אצלכם בסלון או אם ישנה חצר גדולה אך חשוב לציין כי הפרטיות של הנערות מהותית ולכן נבקש שלא יהיו אנשים נוספים בבית בזמן הסדנה"
    },
    {
        question: "איך נראית סדנה חד פעמית?",
        answer: "בסדנה חד פעמית ניתן טעימה מתכנים שונים המעסיקים את הנערות ונתמקד בשני נושאים עיקריים המעניינים במיוחד את קבוצת הבנות והוריהם."
    },
    {
        question: "למה השיח הזה חשוב?",
        answer: "תכנים אלו לרוב לא מדוברים בצורה ישירה עם המבוגרים המשמעותיים בחייהן, בעקבות אילוצים שונים כמו: מבוכה, חוסר זמן, מידת הקירבה בין הצדדים, היעדר כלים לשיח ותחושה כי נושאים אלו מובנים מאליהם. הנערות נמצאות בשלב מבלבל ומסקרן בו הן בוחנות את עצמן ואת עמדותיהן וזקוקות לידע, תמיכה והכוונה."
    },
    {
        question: "לבת שלי יש קושי להשתלב חברתית, האם הסדנה יכולה להתאים לה?",
        answer: "לעיתים כניסה לקבוצה חדשה יכולה להיות מאתגרת או מאיימת, במיוחד לנערות שחוות קושי להשתלב מבחינה חברתית. דווקא נערות אלו יכולות להרגיש בנוח בקבוצה מהסוג הזה מכיוון שהיא מנותקת מהסביבה המוכרת וממערכת החינוך. אנו דואגות לאווירה מקבלת ולא שיפוטית וכך הקבוצה יכולה להחוות על ידן כמערכת תמיכה חברתית משמעותית, בה יכולות הנערות להתאמן במיומנויות חברתיות. "
    },
    {
        question: "האם ישנה שמירת סודיות?",
        answer: "כדי שהנערות ירגישו שהקבוצה הינה מקום מוגן ובטוח בו הן יכולות לשתף בחופשיות וללא מעצורים, אנו מבטיחות לשמור על פרטיותן ומתחייבות על שמירת סודיות, למעט מקרים בהם ישנה חובת דיווח. יחד עם זאת, אנו מעודדות את הנערות להמשיך את השיח גם מחוץ לקבוצה, בבית ובמעגלים החברתיים שלהן."
    },
    {
        question: "איך קוראים למדריכות?",
        answer: "הדסה ומאיה"
    },
]


const Home = () => {
    const { currentAdmin, isRequestCompleted } = useContext(AdminContext);

    const sectionRef = useRef(null);

    const scrollToContactSection = () => {
        sectionRef.current.scrollIntoView({ behavior: 'smooth' });
    };

    return (
        <div className={style.homeContainer}>
            <Header />
            {(isRequestCompleted && !currentAdmin) && <div className={style.contactButton}>
                <CustomButton text='צרו קשר' func={scrollToContactSection} />
            </div>}
            <section className={style.oneSection}>
                <Text textsArr={[
                    `הסדנאות שלנו מועברות בצורה חווייתית ומהנה, דרך משחק, שיח פתוח ומאפשר ותרגול סימולציות מחיי היומיום שלהן. הן מספקות לנערות הכוונה וכלים ליצירת קשרים חברתיים בריאים ולחיזוק הדימוי העצמי החברתי שלהן. חלק מהסדנאות מועברות בשילוב טיפול באמצעות כלבים / סוסים.`,
                    `לאורך השנים בעבודתנו עם נערות, מצאנו כי הן עלולות להיות חשופות לפגיעות שונות בבית הספר ובחברה. בעקבות כך הן פחות נוכחות במפגשים חברתיים, מעדיפות לבלות את מרבית זמנן מול המסך בבית, ומתקשות לייצר חברויות יציבות ובריאות עם סביבתן.`,
                    `מסיבה זו פיתחנו סדנאות שיעצימו אותן ויתנו להן כלים וטכניקות מעולם ה-NLP להתמודדות נכונה יותר בחיי היום יום.`,
                    `מטרת הסדנאות הינה לאפשר שיח עמוק בגובה העיניים, לעודד חשיבה יצירתית ואמיצה, לחזק את הביטחון העצמי, להקנות כלים להתמודדות עם קונפליקטים בכיתה ועם סיטואציות חברתיות מורכבות. בתקופת גיל ההתבגרות הנערות מגבשות את זהותן ולכן חשוב במיוחד לפתח אצלן את המיומנות להקשיב לקולן הפנימי.`
                ]}>
                </Text>
            </section>
            <Sliders />
            <Main />
            <section className={style.secondSection}>
                <BorderLine />
                <Title padding='24px' titlesArr={[
                    { h2: "דוגמה לסדנה לנערות" }
                ]} />
                <div className={style.flexBox}>
                    <div className={`${style.box} ${style.pink}`}>
                        <Title titlesArr={[
                            { h5: "גיל ההתבגרות" }
                        ]} />
                        <Text textsArr={[
                            `מפגש אישי של כל נערה עם תקופת גיל ההתבגרות. נדבר על התהליך שכל נערה עוברת בהפיכתה לאישה. ניתן ידע וננהל שיח פתוח על השינויים הפיזיולוגיים, הפסיכולוגיים והקוגניטיביים המאפיינים תקופה זו. נחקור איך זה להיות "בת" ונבחן אתגרים, התנסויות ושאלות המעסיקות את הנערות.`
                        ]} />
                    </div>
                    <div className={`${style.box} ${style.turquoise}`}>
                        <Title titlesArr={[
                            { h5: "הבנייה מגדרית ותרבותית" }
                        ]} />
                        <Text textsArr={[
                            `במפגש זה נתרגל ונתנסה בחשיבה ביקורתית. נחקור את המושג "האישה האידיאלית" ואת הדרך שבה התרבות מחנכת אותנו להיות "בנות", נעסוק בדפוסי חשיבה מגדריים ואיך זה בא לידי ביטוי בחיינו, נכיר נשים יוצאות דופן שהשמיעו את קולן ויצרו שינויים בעולם ונעסוק במודל היופי, בשאיפות לעתיד, בדימוי גוף ובאהבת הגוף.`
                        ]} />
                    </div>
                    <div className={`${style.box} ${style.yellow}`}>
                        <Title titlesArr={[
                            { h5: "דימוי עצמי ורשתות חברתיות" }
                        ]} />
                        <Text textsArr={[
                            `במפגש נתבונן פנימה ונבחן את הדרך בה כל אחת בוחרת להציג את עצמה במדיה. נעסוק במיקום הרשת בחיינו, נבחן את סוגי הקשרים שאנו יוצרות ברשת ונדבר על היתרונות והחסרונות של הרשתות החברתיות. נדבר על תרבות הסלפי, על אמת ושקר במדיה, על בריונות ושיימינג ונחקור מהם הקווים האדומים של כל אחת.`
                        ]} />
                    </div>
                    <div className={`${style.box} ${style.purple}`}>
                        <Title titlesArr={[
                            { h5: "תקשורת והתמודדות במצבי סיכון" }
                        ]} />
                        <Text textsArr={[
                            `במפגש נדבר על יחסים ואיפה כל אחת ממקמת את עצמה בתוכם. נדבר על גבולות בקשרים חברתיים ונבחן מצבי סיכון שונים ביניהם חרם, שיימינג, אלכוהול והשפעות הלחץ החברתי. נלמד להקשיב לאינטואיציות, נרכוש כלים ומיומנויות לקבלת החלטות נכונות ולהתמודדות עם קונפליקטים.`
                        ]} />
                    </div>
                </div>
                <BorderLine />
            </section>
            <section className={style.thirdSection}>
                <Title padding='24px' titlesArr={[
                    { h2: "מי אנחנו?" }
                ]} />
                <div className={style.imgFlexBox}>
                    <Card className={style.card} elevation={12}>
                        <div className={style.imgBox}>
                            <img className={style.img} src={hadassaPic} width={200} height={200} alt="pic" />
                            <Title titlesArr={[
                                { h3: "הדסה גבאי" }
                            ]} />
                            <Text textsArr={[
                                `בעלת תואר שני (MSW) בעבודת סוציאלית קלינית מטעם אוניברסיטת בר אילן. רכשתי ניסיון רב בעבודה עם ילדים, בני נוער והוריהם במסגרות שונות, ביניהן כמדריכת הורים בתכנית התערבות מניעתית למשפחות בסיכון, בהעברת סדנאות להורים וילדים לחיזוק קשר הורה-ילד ובעבודה עם בני נוער וצעירים המנוצלים מינית ומסחרית בפרויקט טיפולי שיקומי. כיום אני עובדת ביחידה טיפולית לבני נוער בסיכון באגף לשירותים חברתיים, מלווה אותם כמטפלת פרטנית ו/או קבוצתית לשיפור תפקודם האישי, המשפחתי והחברתי.`,
                                `אמא לשני ילדים ומאמינה כי נערות צריכות ויכולות ללמוד לאהוב את עצמן, לרדוף אחרי החלומות שלהן ולחיות בביטחון שקולן ישמע.`
                            ]} />
                        </div>
                    </Card>
                    <Card className={style.card} elevation={12}>
                        <div className={style.imgBox}>
                            <img className={style.img} src={mayaPic} width={200} height={200} alt="pic" />
                            <Title titlesArr={[
                                { h3: "מאיה דון" }
                            ]} />
                            <Text textsArr={[
                                `בעלת תואר שני (MSW) בעבודה סוציאלית קלינית מטעם אוניברסיטת תל אביב. בעלת ניסיון בעבודה טיפולית הן פרטנית והן קבוצתית עם ילדים, בני נוער והוריהם במסגרות שונות. כמו כן, לאורך השנים ליוויתי וטיפלתי בנערות וצעירות עם מורכבויות חיים שונות. כיום אני עובדת ביחידה טיפולית לבני נוער בסיכון באגף לשירותים חברתיים, כמטפלת פרטנית וכמלווה משפחות הנמצאות במצבים שונים המצריכים סיוע, ליווי והדרכה. בנוסף,  עובדת כמנחת סדנאות במרכז סיוע לנפגעות ולנפגעי תקיפה מינית. `,
                                `האמונה אשר מובילה אותי בעבודתי עם נערות וצעירות, היא כי מעבר לעזרה הקונקרטית, פעמים רבות הדבר שהן זקוקות לו יותר מכל הינו דמות מיטיבה, אשר תאמין בהן, תתמוך, תיראה בהן את הטוב ותסייע להן לראות אותו גם בעצמן. `
                            ]} />
                        </div>
                    </Card>
                </div>
            </section>
            <section className={style.commonQuestions}>
                <BorderLine />
                <Title padding='24px' titlesArr={[
                    { h2: "שאלות נפוצות" }
                ]} />
                <div className={style.questions}>
                    {questions.map((question, index) => <Question key={index} question={question.question} answer={question.answer} />)}
                </div>
                <BorderLine />
            </section>
            <section className={style.gallery}>
                <Gallery />
            </section>
            <section ref={sectionRef} className={style.contact}>
                <BorderLine />
                <Contact />
                <BorderLine />
            </section>
            <Footer />
        </div>
    )
}

export default Home;